{
  "results": [
    {
      "id": 0,
      "name": "MovieBox",
      "poster_path": "MovieBoxTn",
      "previewDesc": "A fullstack movie data web app, featuring detailed info about shows and movies",
      "Lang": "MERN • TypeScript • Nextjs • Scss • Bootstrap",
      "description": [
          "A feature-rich Full-Stack movie data web app, inspired by popular movie streaming services like Netflix and Hulu. This project was developed using Next.js, TypeScript, Node.js, Express.js, MongoDB with mongoose, SCSS, Bootstrap and uses JWT for authentication. Next.js leverages the App Router for efficient navigation, improved SEO, and server-side rendering (SSR) for faster page loads. The platform integrates with the TMDB (The Movie Database) API to access a vast repository of film data, including movie details, cast information, trailers, and reviews. This integration enables the platform to offer users a comprehensive and up-to-date library of movies and TV shows. Users can search for their favorite films, explore curated lists, discover new movies, and change various settings. | It also has an account system with authentication allowing users to signup, login or join as a guest | In addittion, The UI/UX is designed to be unique and intuitive, with a focus on easy navigation and accessibility, with support for both light and dark mode themes."
      ],
      "ProjectLink": "0",
      "SourceLink": "https://github.com/AtomicExpresso/movie-app",
      "PreviewLink": "https://moviebox-nextjs-sooty.vercel.app/",
      "features": [
        {
          "title": "Account system with authentication",
          "description": "Users can login, signup or join as a guest. Making an account allows the user to add movies to lists"
        },
        {
          "title": "Movies & Shows page",
          "description": "Page's displaying a list of movies and shows seperated by different genere's, such as Action, Animation, Documentery, Etc."
        },
        {
          "title": "Discover page",
          "description": "Use's pagination and allows you to explore many diffrent movie titles and shows, also has a search bar to find a specific film"
        },
        {
          "title": "Settings menu",
          "description": "The settings menu allows you to change the websites theme and filter out specific content. Changes are saved in localstorage and load when ever you visit the website again"
        },
        {
          "title": "Data & film info",
          "description": "Each movie and show displays various metrics showing, the rating, cast, description, run time, etc. Addittionaly, it will also display similar films and shows to the one your currently viewing."
        },
        {
          "title": "show info",
          "description": "For shows, you can view a list of seasons and episodes with information about each episode"
        },
        {
          "title": "Mobile support and responsive design",
          "description": "The project was built with resposnvie design ensuring flexability accross different devices"
        }
      ]
    },
    {
      "id": 1,
      "name": "Personal Website",
      "poster_path": "PersonalWebsiteTn",
      "previewDesc": "My portfoilo and Personal website, it has my projects and blog",
      "Lang": "React • TypeScript • Nextjs • Sass • Bootstrap",
      "description": [
        "My personal website and developer porfiolo"
      ],
      "ProjectLink": "1",
      "SourceLink": "https://github.com/AtomicExpresso/developer-portfolio",
      "PreviewLink": "/",
      "features": [
        {
          "title": "Responsive design",
          "description": "Website was built with responsive design in mind, ensuring support accross different devices"
        },
        {
          "title": "Dynamic blog page's with markdown",
          "description": "Dynamic pages that use's the Gray matter package to support markdown"
        },
        {
          "title": "Detailed Project's, Contact and About page",
          "description": "Website contains detailed information about various projects ive worked on, as well as a few other pages."
        },
        {
          "title": "Server Side rendering & SEO",
          "description": "uses Nextjs to support SSR as well as other features and uses SEO best practices"
        }
      ]
    }
  ]
}