{
  "title": "Developer Portfolios",
  "sections": [
    {
      "title": "Introduction",
      "content": "Developer portfolios are an excellent tool for making a lasting impression on potential clients or recruiters. In this article, I'll walk you through how I built my portfolio and my thought process behind it."
    },
    {
      "title": "Things to consider",
      "content": "When i was building my portfolio, i wanted the visitor to be able to:",
      "list": [
        {
          "item": "Find my portfolio easily on the internet"
        },
        {
          "item": "Easily contact me, using either social media or email"
        },
        {
          "item": "See my projects and what kind of work i do"
        }
      ]
    },
    {
      "title": "Deciding on a theme",
      "content": [
        {
          "paragraph": "Before I started building my portfolio website, I wanted to look through some other developer portfolios to give me some ideas, fortunately  I found a github repo that had a huge list of"
        },
        {
          "paragraph": "When I was choosing my theme, I wanted something that would not only reflect my skills and experience but also capture attention and leave a positive impression on the visitor. I decided to go with a creative and modern approach to my theme."
        },
        {
          "paragraph": "By opting for a creative and modern theme, I'm signaling to visitors that I try to think out-of-the box and I'm able to keep up with the latest trends in UI design.  Overall, this theme speaks to who I am as a developer; someone who values creativity, and innovation."
        }
      ],
      "links": [
        {
          "link": "https://github.com/emmabostian/developer-portfolios",
          "title": "Dev Portfolios repo"
        }
      ]
    },
    {
      "title": "Key features",
      "content": "Once I settled on a theme, I dived into the project build. For the tech stack, I chose React, Sass, and Bootstrap for the front-end..."
    },
    {
      "title": "Home page",
      "content": [
        {
          "paragraph": "The home page is the first thing a user sees, as such it's important for it to contain important info while also being easy to navigate / read. When designing this section, my main objective was to:"
        }
      ],
      "list": [
        {
          "item": "Give the visitor a brief introduction to who i am"
        },
        {
          "item": "Display my skills, both development and tech related"
        },
        {
          "item": "Showcase my projects"
        }
      ]
    },
    {
      "title": "Projects page",
      "content": "The projects page shows the visitor the various projects i've worked on, i also included info about the tech stack i used and left links to see both a live view and the source code. I decided to only include major projects I've worked on so I could show my skills more in depth."
    },
    {
      "title": "Blog page:",
      "content": "Here you'll find articles I have written. The blog posts also go in depth about case studies and what sort of issues I solved. This helps give the visitor an idea about my thought process and how I solve potential problems in projects."
    },
    {
      "title": "About me and contact:",
      "content": [
        {
          "paragraph": "Finally, on the About Me and Contact page, you'll find a deeper dive into who I am. The About Me section offers insights into my background and personality, giving visitors a better understanding of the person behind the projects."
        },
        {
          "paragraph": "The contact form allows people to send me an email directly from the website. I also made sure to add a max character limit to help prevent unnecessary long messages or spam"
        }
      ]
    },
    {
      "title": "Conclusion",
      "content": "That about wraps it up! That was the breakdown on how I built my portfolio from scratch. I built it entirely in react and sass. It turned out a lot better than I thought it would and i’m excited to continue refining and expanding my portfolio as my journey in tech progresses. If you're curious about any specific aspect or want to discuss further, feel free to reach out. Until then, keep coding! 👩‍💻🚀."
    }
  ]
}